{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "an": 257,
      "ar": 258,
      "in": 259,
      "il": 260,
      "sh": 261,
      "da": 262,
      "Ġb": 263,
      "di": 264,
      "lar": 265,
      "ch": 266,
      "li": 267,
      "Ġk": 268,
      "Ġo": 269,
      "at": 270,
      "iy": 271,
      "Ġt": 272,
      "ga": 273,
      "on": 274,
      "ish": 275,
      "or": 276,
      "ing": 277,
      "la": 278,
      "Ġm": 279,
      "er": 280,
      "gan": 281,
      "om": 282,
      "ir": 283,
      "Ġq": 284,
      "va": 285,
      "as": 286,
      "Ġs": 287,
      "yil": 288,
      "Ġva": 289,
      "ida": 290,
      "un": 291,
      "Ġbo": 292,
      "Ġe": 293,
      "dan": 294,
      "ini": 295,
      "ot": 296,
      "chi": 297,
      "20": 298,
      "Ġy": 299,
      "en": 300,
      "gi": 301,
      "ni": 302,
      "Ġu": 303,
      "Ġa": 304,
      "iya": 305,
      "ol": 306,
      "lari": 307,
      "Ġd": 308,
      "Ġh": 309,
      "al": 310,
      "omp": 311,
      "Ġ1": 312,
      "ĠS": 313,
      "ĠA": 314,
      "Ġta": 315,
      "ompan": 316,
      "am": 317,
      "ta": 318,
      "ning": 319,
      "ur": 320,
      "ay": 321,
      "ti": 322,
      "ĠM": 323,
      "lan": 324,
      "ĠB": 325,
      "Ġr": 326,
      "Ġf": 327,
      "oy": 328,
      "Ġish": 329,
      "ob": 330,
      "Ġ20": 331,
      "Ġkompan": 332,
      "ek": 333,
      "Ġqil": 334,
      "lab": 335,
      "asi": 336,
      "ib": 337,
      "Ġsh": 338,
      "Ġn": 339,
      "ĠC": 340,
      "os": 341,
      "is": 342,
      "adi": 343,
      "ab": 344,
      "cha": 345,
      "el": 346,
      "lik": 347,
      "ik": 348,
      "lash": 349,
      "ĠG": 350,
      "av": 351,
      "Ġbir": 352,
      "qar": 353,
      "ining": 354,
      "ĠT": 355,
      "Ġj": 356,
      "iz": 357,
      "Ġuch": 358,
      "im": 359,
      "Ġchi": 360,
      "yilda": 361,
      "uv": 362,
      "it": 363,
      "es": 364,
      "Ġp": 365,
      "ĠF": 366,
      "Ġbil": 367,
      "Ġbosh": 368,
      "Ġ(": 369,
      "ĠJ": 370,
      "tir": 371,
      "Ġko": 372,
      "Ġx": 373,
      "ĠP": 374,
      "Ġuchun": 375,
      "ilgan": 376,
      "ma": 377,
      "Ġbilan": 378,
      "um": 379,
      "illi": 380,
      "ah": 381,
      "ro": 382,
      "Ġmilli": 383,
      "Ġto": 384,
      "siya": 385,
      "Ġol": 386,
      "Ġ19": 387,
      "ati": 388,
      "us": 389,
      "et": 390,
      "Ġoy": 391,
      "aq": 392,
      "oz": 393,
      "if": 394,
      "Ġsot": 395,
      "idan": 396,
      "ĠK": 397,
      "Ġishlab": 398,
      "Ġkompaniy": 399,
      "âĢ": 400,
      "Ġ201": 401,
      "dagi": 402,
      "Ġchiqar": 403,
      "ki": 404,
      "ov": 405,
      "Ġet": 406,
      "iga": 407,
      "ey": 408,
      "ul": 409,
      "ĠD": 410,
      "larini": 411,
      "Ġda": 412,
      "ari": 413,
      "Ġkompaniya": 414,
      "larni": 415,
      "'s": 416,
      "Ġqo": 417,
      "ĠI": 418,
      "lib": 419,
      "ka": 420,
      "Ġoyida": 421,
      "Ġav": 422,
      "ĠR": 423,
      "Ġbu": 424,
      "Ġdol": 425,
      "st": 426,
      "oq": 427,
      "ak": 428,
      "iq": 429,
      "ng": 430,
      "dir": 431,
      "Ġtash": 432,
      "00": 433,
      "obil": 434,
      "Ġber": 435,
      "chil": 436,
      "ĠL": 437,
      "por": 438,
      "lish": 439,
      "ĠE": 440,
      "Ġi": 441,
      "ard": 442,
      "19": 443,
      "Ġavt": 444,
      "ladi": 445,
      "idagi": 446,
      "ent": 447,
      "ra": 448,
      "ĠH": 449,
      "ĠV": 450,
      "Ġma": 451,
      "og": 452,
      "liy": 453,
      "ut": 454,
      "omobil": 455,
      "si": 456,
      "Ġ2": 457,
      "od": 458,
      "inchi": 459,
      "aning": 460,
      "Ġqildi": 461,
      "ĠO": 462,
      "uning": 463,
      "ĠCh": 464,
      "Ġham": 465,
      "larga": 466,
      "omon": 467,
      "ush": 468,
      "Ġyan": 469,
      "sa": 470,
      "Ġay": 471,
      "Ġmillion": 472,
      "son": 473,
      "Ġavtomobil": 474,
      "ud": 475,
      "ĠSh": 476,
      "Ġtomon": 477,
      "Ġsotib": 478,
      "qa": 479,
      "art": 480,
      "Ġso": 481,
      "201": 482,
      "ic": 483,
      "oyda": 484,
      "Ġor": 485,
      "err": 486,
      "Ġnom": 487,
      "kil": 488,
      "ĠU": 489,
      "Ġyo": 490,
      "ks": 491,
      "ed": 492,
      "ev": 493,
      "icha": 494,
      "Ġedi": 495,
      "Ġtomonidan": 496,
      "em": 497,
      "Ġas": 498,
      "Ġz": 499,
      "Ġtashkil": 500,
      "Ġmilliard": 501,
      "langan": 502,
      "tor": 503,
      "QS": 504,
      "id": 505,
      "asini": 506,
      "'t": 507,
      "ig": 508,
      "âĢĶ": 509,
      "siy": 510,
      "ĠN": 511,
      "eb": 512,
      "Ġ3": 513,
      "Ġfoyda": 514,
      "uvchi": 515,
      "lgan": 516,
      "lon": 517,
      "le": 518,
      "ishi": 519,
      "uq": 520,
      "Ġtar": 521,
      "ĠAQS": 522,
      "Ġ200": 523,
      "Ġyil": 524,
      "Ġega": 525,
      "Ġeng": 526,
      "Ġv": 527,
      "Ġin": 528,
      "Ġch": 529,
      "uk": 530,
      "ran": 531,
      "Ġke": 532,
      "ug": 533,
      "ildi": 534,
      "mat": 535,
      "yicha": 536,
      "uz": 537,
      "ĠGE": 538,
      "oh": 539,
      "tr": 540,
      "Ġchiq": 541,
      "ĠY": 542,
      "Ġg": 543,
      "ok": 544,
      "abr": 545,
      "atida": 546,
      "ag": 547,
      "ad": 548,
      "Ġkor": 549,
      "lariga": 550,
      "Ġte": 551,
      "bu": 552,
      "and": 553,
      "oliy": 554,
      "Ġkompaniyasi": 555,
      "Ġasos": 556,
      "Ġqar": 557,
      "ank": 558,
      "Ġ\"": 559,
      "chilar": 560,
      "ĠâĢĶ": 561,
      "dek": 562,
      "of": 563,
      "Ġdav": 564,
      "ash": 565,
      "tat": 566,
      "ub": 567,
      "organ": 568,
      "lashtir": 569,
      "Ġjoy": 570,
      "ĠX": 571,
      "larning": 572,
      "ĠFerr": 573,
      "Ġdollar": 574,
      "tab": 575,
      "larda": 576,
      "Ġqilish": 577,
      "Ġfoydalan": 578,
      "zining": 579,
      "kaz": 580,
      "Ġsif": 581,
      "port": 582,
      "ĠAQSh": 583,
      "ĠIn": 584,
      "ter": 585,
      "larida": 586,
      "kon": 587,
      "atsiya": 588,
      "uni": 589,
      "Ġbirinchi": 590,
      "ldi": 591,
      "ĠW": 592,
      "Ġchiqarish": 593,
      "Ġyangi": 594,
      "Ġ&": 595,
      "Ġ5": 596,
      "ĠQ": 597,
      "ĠĊ": 598,
      "Ġak": 599,
      "Ġoldi": 600,
      "ja": 601,
      "do": 602,
      "Ġkir": 603,
      "asida": 604,
      "Ġsifatida": 605,
      "Ġshah": 606,
      "ingan": 607,
      "lashgan": 608,
      "Ġolish": 609,
      "eyin": 610,
      "gar": 611,
      "lay": 612,
      "Ġhis": 613,
      "yo": 614,
      "mer": 615,
      "zor": 616,
      "iladi": 617,
      "ligi": 618,
      "Ġosh": 619,
      "Ġmu": 620,
      "irik": 621,
      "ĠFerrari": 622,
      "ani": 623,
      "dim": 624,
      "asining": 625,
      "Ġyirik": 626,
      "kor": 627,
      "lat": 628,
      "Ġhar": 629,
      "ektor": 630,
      "Ġdun": 631,
      "Ġxiz": 632,
      "Ġetdi": 633,
      "Ġik": 634,
      "Ġdir": 635,
      "landi": 636,
      "ĠJP": 637,
      "ali": 638,
      "Ġhisob": 639,
      "Ġ4": 640,
      "Ġl": 641,
      "'m": 642,
      "Ġmar": 643,
      "Ġmah": 644,
      "sul": 645,
      "Ġdeb": 646,
      "Ġdast": 647,
      "uningdek": 648,
      "up": 649,
      "Ġga": 650,
      "ĠCo": 651,
      "Ġdirektor": 652,
      "ĠSt": 653,
      "ac": 654,
      "ax": 655,
      "Ġdo": 656,
      "ayt": 657,
      "ij": 658,
      "lig": 659,
      "ĠBu": 660,
      "ika": 661,
      "aviy": 662,
      "moq": 663,
      "var": 664,
      "Ġam": 665,
      "Ġdar": 666,
      "ĠSp": 667,
      "iff": 668,
      "Ġjoylashgan": 669,
      "mo": 670,
      "rin": 671,
      "Ġuning": 672,
      "ishni": 673,
      "ers": 674,
      "Ġyar": 675,
      "lov": 676,
      "re": 677,
      "Ġdunyo": 678,
      "sulot": 679,
      "ior": 680,
      "Ġkeyin": 681,
      "Ġboshqar": 682,
      "xon": 683,
      "Ġbiz": 684,
      "Ġtur": 685,
      "Ġjam": 686,
      "Ġshahr": 687,
      "ator": 688,
      "Ġtan": 689,
      "200": 690,
      "Ġ-": 691,
      "shi": 692,
      "âĢĻ": 693,
      "ts": 694,
      "lardan": 695,
      "Ġre": 696,
      "Ġzav": 697,
      "Ġxizmat": 698,
      "iffan": 699,
      "sat": 700,
      "iyat": 701,
      "Ġtaq": 702,
      "ohn": 703,
      "Ġmahsulot": 704,
      "nes": 705,
      "Ġim": 706,
      "Ġtel": 707,
      "ase": 708,
      "Ġesa": 709,
      "iffany": 710,
      "dor": 711,
      "ilar": 712,
      "liq": 713,
      "Ġqis": 714,
      "tabr": 715,
      "af": 716,
      "ri": 717,
      "Ġkam": 718,
      "erg": 719,
      "Ġal": 720,
      "ha": 721,
      "Ġbozor": 722,
      "tiq": 723,
      "ren": 724,
      "oni": 725,
      "Ġmav": 726,
      "ĠChase": 727,
      "rans": 728,
      "ep": 729,
      "mi": 730,
      "gacha": 731,
      "Ġsav": 732,
      "Ġdavom": 733,
      "lek": 734,
      "tsiya": 735,
      "larining": 736,
      "unda": 737,
      "laridan": 738,
      "ĠJohn": 739,
      "Ġkorpor": 740,
      "SA": 741,
      "yin": 742,
      "indi": 743,
      "Ġhaq": 744,
      "ĠJon": 745,
      "kin": 746,
      "Ġken": 747,
      "ishga": 748,
      "ĠAmer": 749,
      "magan": 750,
      "Ġ199": 751,
      "Ġetilgan": 752,
      "Ġbiznes": 753,
      "pr": 754,
      "siyasi": 755,
      "Ġyarat": 756,
      "ll": 757,
      "anal": 758,
      "asm": 759,
      "yildan": 760,
      "Ġtak": 761,
      "lanadi": 762,
      "oiz": 763,
      "Ġfoiz": 764,
      "ĠTiffany": 765,
      "Ġboshqa": 766,
      "Ġmash": 767,
      "Ġorqa": 768,
      "Morgan": 769,
      "Ġkon": 770,
      "az": 771,
      "lif": 772,
      "Ġkab": 773,
      "ist": 774,
      "ĠDior": 775,
      "pp": 776,
      "vig": 777,
      "ina": 778,
      "shbu": 779,
      "Ġtush": 780,
      "Ġbiri": 781,
      "Ġortiq": 782,
      "agen": 783,
      "MW": 784,
      "Ġbank": 785,
      "Ġqur": 786,
      "Ġqay": 787,
      "Ġtex": 788,
      "Ġdastur": 789,
      "rsat": 790,
      "wagen": 791,
      "ishini": 792,
      "Ġul": 793,
      "olks": 794,
      "Ġshuningdek": 795,
      "Ġorqali": 796,
      "olkswagen": 797,
      "hma": 798,
      "ĠĠ": 799,
      "otif": 800,
      "Ġkompaniyaning": 801,
      "ĠJohnson": 802,
      "vigat": 803,
      "otify": 804,
      "nol": 805,
      "per": 806,
      "Ġdi": 807,
      "Ġmoliy": 808,
      "yilning": 809,
      "mas": 810,
      "Ġraq": 811,
      "Ġdollarga": 812,
      "Ġichi": 813,
      "lum": 814,
      "pi": 815,
      "Ġ6": 816,
      "Ġ7": 817,
      "Ġkel": 818,
      "iyasi": 819,
      "Ġmod": 820,
      "oti": 821,
      "ompaniya": 822,
      "Ġikki": 823,
      "ada": 824,
      "ding": 825,
      "Ġil": 826,
      "enc": 827,
      "Ġdvigat": 828,
      "Ġro": 829,
      "osi": 830,
      "Ġolgan": 831,
      "Ġoshir": 832,
      "21": 833,
      "eug": 834,
      "ler": 835,
      "oda": 836,
      "Ġbar": 837,
      "lagan": 838,
      "Ġkompaniyasining": 839,
      "ff": 840,
      "vo": 841,
      "Ġhol": 842,
      "ĠSpotify": 843,
      "ĠJonson": 844,
      "Ġkabi": 845,
      "Ġqilgan": 846,
      "ahon": 847,
      "Ġhamkor": 848,
      "Ġyoki": 849,
      "ĠAmerika": 850,
      "Ġtaklif": 851,
      "encent": 852,
      "euge": 853,
      "alar": 854,
      "Ġok": 855,
      "Ġqol": 856,
      "ĠBMW": 857,
      "itoy": 858,
      "tirish": 859,
      "ĠPSA": 860,
      "Ġ198": 861,
      "Ġkorxon": 862,
      "ĠJPMorgan": 863,
      "Ġulush": 864,
      "eugeot": 865,
      "50": 866,
      "yu": 867,
      "zgar": 868,
      "Ġbren": 869,
      "Ġmum": 870,
      "enz": 871,
      "Ġjar": 872,
      "Ġnomi": 873,
      "Ġsavdo": 874,
      "ris": 875,
      "Ġ8": 876,
      "ang": 877,
      "eral": 878,
      "otgan": 879,
      "ust": 880,
      "Ġchiqaruvchi": 881,
      "000": 882,
      "Ġmumkin": 883,
      "ech": 884,
      "jud": 885,
      "rt": 886,
      "Ġ,": 887,
      "ĠAl": 888,
      "ĠTencent": 889,
      "roup": 890,
      "ĠRos": 891,
      "Ġbuy": 892,
      "ĠInc": 893,
      "Ġkenga": 894,
      "Ġqayta": 895,
      "Ġdvigatel": 896,
      "man": 897,
      "orat": 898,
      "lak": 899,
      "ast": 900,
      "tirdi": 901,
      "Ġij": 902,
      "evro": 903,
      "Ġmavjud": 904,
      "Ġsport": 905,
      "ĠBir": 906,
      "Ġfa": 907,
      "Ġqiladi": 908,
      "roq": 909,
      "Ġasosiy": 910,
      "ligini": 911,
      "op": 912,
      "Ġiy": 913,
      "Ġbor": 914,
      "Ġkuni": 915,
      "iyaning": 916,
      "eri": 917,
      "Ġyet": 918,
      "chalik": 919,
      "uvchilar": 920,
      "may": 921,
      "masi": 922,
      "Ġdan": 923,
      "arbu": 924,
      "Ġolib": 925,
      "Ġyor": 926,
      "ĠPeugeot": 927,
      "Ġ2018": 928,
      "ĠVolkswagen": 929,
      "artn": 930,
      "ĠQo": 931,
      "Ġaksiya": 932,
      "Ġdarom": 933,
      "Ġjamo": 934,
      "Ġzavod": 935,
      "Ġtaqdim": 936,
      "arbuc": 937,
      "ros": 938,
      "voz": 939,
      "yut": 940,
      "Ġ18": 941,
      "ĠAd": 942,
      "ĠMorgan": 943,
      "Ġrek": 944,
      "obe": 945,
      "umla": 946,
      "asmiy": 947,
      "arbucks": 948,
      "alari": 949,
      "edi": 950,
      "for": 951,
      "na": 952,
      "osh": 953,
      "uh": 954,
      "udi": 955,
      "dam": 956,
      "lim": 957,
      "ishda": 958,
      "Ġvaq": 959,
      "ozir": 960,
      "ĠShtat": 961,
      "Ġkelib": 962,
      "ba": 963,
      "gil": 964,
      "hur": 965,
      "odi": 966,
      "zi": 967,
      "ork": 968,
      "ĠGroup": 969,
      "ĠFed": 970,
      "ĠEn": 971,
      "Ġdunyodagi": 972,
      "kan": 973,
      "ation": 974,
      "Ġkompaniyasini": 975,
      "ĠStarbucks": 976,
      "umladan": 977,
      "'ll": 978,
      "biy": 979,
      "qiq": 980,
      "yx": 981,
      "Ġkat": 982,
      "Ġtrans": 983,
      "Ġmus": 984,
      "Ġ10": 985,
      "Ġtark": 986,
      "laydi": 987,
      "Ġmashhur": 988,
      "oog": 989,
      "ves": 990,
      "Ġ%": 991,
      "Ġtiz": 992,
      "ort": 993,
      "Ġmay": 994,
      "Ġpoy": 995,
      "nolog": 996,
      "Ġhamkorlik": 997,
      "ap": 998,
      "he": 999
    },
    "merges": [
      "a n",
      "a r",
      "i n",
      "i l",
      "s h",
      "d a",
      "Ġ b",
      "d i",
      "l ar",
      "c h",
      "l i",
      "Ġ k",
      "Ġ o",
      "a t",
      "i y",
      "Ġ t",
      "g a",
      "o n",
      "i sh",
      "o r",
      "in g",
      "l a",
      "Ġ m",
      "e r",
      "g an",
      "o m",
      "i r",
      "Ġ q",
      "v a",
      "a s",
      "Ġ s",
      "y il",
      "Ġ va",
      "i da",
      "u n",
      "Ġb o",
      "Ġ e",
      "d an",
      "in i",
      "o t",
      "ch i",
      "2 0",
      "Ġ y",
      "e n",
      "g i",
      "n i",
      "Ġ u",
      "Ġ a",
      "iy a",
      "o l",
      "lar i",
      "Ġ d",
      "Ġ h",
      "a l",
      "om p",
      "Ġ 1",
      "Ġ S",
      "Ġ A",
      "Ġt a",
      "omp an",
      "a m",
      "t a",
      "n ing",
      "u r",
      "a y",
      "t i",
      "Ġ M",
      "l an",
      "Ġ B",
      "Ġ r",
      "Ġ f",
      "o y",
      "Ġ ish",
      "o b",
      "Ġ 20",
      "Ġk ompan",
      "e k",
      "Ġq il",
      "la b",
      "as i",
      "i b",
      "Ġ sh",
      "Ġ n",
      "Ġ C",
      "o s",
      "i s",
      "a di",
      "a b",
      "ch a",
      "e l",
      "li k",
      "i k",
      "la sh",
      "Ġ G",
      "a v",
      "Ġb ir",
      "q ar",
      "in ing",
      "Ġ T",
      "Ġ j",
      "i z",
      "Ġu ch",
      "i m",
      "Ġ chi",
      "yil da",
      "u v",
      "i t",
      "e s",
      "Ġ p",
      "Ġ F",
      "Ġb il",
      "Ġbo sh",
      "Ġ (",
      "Ġ J",
      "t ir",
      "Ġk o",
      "Ġ x",
      "Ġ P",
      "Ġuch un",
      "il gan",
      "m a",
      "Ġbil an",
      "u m",
      "il li",
      "a h",
      "r o",
      "Ġm illi",
      "Ġt o",
      "s iya",
      "Ġo l",
      "Ġ1 9",
      "at i",
      "u s",
      "e t",
      "Ġo y",
      "a q",
      "o z",
      "i f",
      "Ġs ot",
      "i dan",
      "Ġ K",
      "Ġish lab",
      "Ġkompan iy",
      "â Ģ",
      "Ġ20 1",
      "da gi",
      "Ġchi qar",
      "k i",
      "o v",
      "Ġe t",
      "i ga",
      "e y",
      "u l",
      "Ġ D",
      "lar ini",
      "Ġ da",
      "ar i",
      "Ġkompan iya",
      "lar ni",
      "' s",
      "Ġq o",
      "Ġ I",
      "li b",
      "k a",
      "Ġoy ida",
      "Ġa v",
      "Ġ R",
      "Ġb u",
      "Ġd ol",
      "s t",
      "o q",
      "a k",
      "i q",
      "n g",
      "di r",
      "Ġta sh",
      "0 0",
      "ob il",
      "Ġb er",
      "ch il",
      "Ġ L",
      "p or",
      "li sh",
      "Ġ E",
      "Ġ i",
      "ar d",
      "1 9",
      "Ġav t",
      "la di",
      "ida gi",
      "en t",
      "r a",
      "Ġ H",
      "Ġ V",
      "Ġm a",
      "o g",
      "li y",
      "u t",
      "om obil",
      "s i",
      "Ġ 2",
      "o d",
      "in chi",
      "an ing",
      "Ġqil di",
      "Ġ O",
      "un ing",
      "ĠC h",
      "Ġh am",
      "lar ga",
      "om on",
      "u sh",
      "Ġy an",
      "s a",
      "Ġa y",
      "Ġmilli on",
      "s on",
      "Ġavt omobil",
      "u d",
      "ĠS h",
      "Ġt omon",
      "Ġsot ib",
      "q a",
      "ar t",
      "Ġs o",
      "20 1",
      "i c",
      "oy da",
      "Ġo r",
      "er r",
      "Ġn om",
      "k il",
      "Ġ U",
      "Ġy o",
      "k s",
      "e d",
      "e v",
      "i cha",
      "Ġe di",
      "Ġtomon idan",
      "e m",
      "Ġ as",
      "Ġ z",
      "Ġtash kil",
      "Ġmilli ard",
      "lan gan",
      "t or",
      "Q S",
      "i d",
      "as ini",
      "' t",
      "i g",
      "âĢ Ķ",
      "s iy",
      "Ġ N",
      "e b",
      "Ġ 3",
      "Ġf oyda",
      "uv chi",
      "l gan",
      "l on",
      "l e",
      "ish i",
      "u q",
      "Ġt ar",
      "ĠA QS",
      "Ġ20 0",
      "Ġ yil",
      "Ġe ga",
      "Ġe ng",
      "Ġ v",
      "Ġ in",
      "Ġ ch",
      "u k",
      "r an",
      "Ġk e",
      "u g",
      "il di",
      "m at",
      "y icha",
      "u z",
      "ĠG E",
      "o h",
      "t r",
      "Ġchi q",
      "Ġ Y",
      "Ġ g",
      "o k",
      "ab r",
      "at ida",
      "a g",
      "a d",
      "Ġk or",
      "lari ga",
      "Ġt e",
      "b u",
      "an d",
      "o liy",
      "Ġkompaniy asi",
      "Ġas os",
      "Ġq ar",
      "an k",
      "Ġ \"",
      "chil ar",
      "Ġ âĢĶ",
      "d ek",
      "o f",
      "Ġda v",
      "a sh",
      "t at",
      "u b",
      "or gan",
      "lash tir",
      "Ġj oy",
      "Ġ X",
      "lar ning",
      "ĠF err",
      "Ġdol lar",
      "ta b",
      "lar da",
      "Ġqil ish",
      "Ġfoyda lan",
      "z ining",
      "ka z",
      "Ġs if",
      "por t",
      "ĠAQS h",
      "ĠI n",
      "t er",
      "lar ida",
      "k on",
      "at siya",
      "un i",
      "Ġbir inchi",
      "l di",
      "Ġ W",
      "Ġchiqar ish",
      "Ġyan gi",
      "Ġ &",
      "Ġ 5",
      "Ġ Q",
      "Ġ Ċ",
      "Ġa k",
      "Ġol di",
      "j a",
      "d o",
      "Ġk ir",
      "as ida",
      "Ġsif atida",
      "Ġsh ah",
      "ing an",
      "lash gan",
      "Ġo lish",
      "ey in",
      "g ar",
      "la y",
      "Ġh is",
      "y o",
      "m er",
      "z or",
      "il adi",
      "li gi",
      "Ġo sh",
      "Ġm u",
      "ir ik",
      "ĠFerr ari",
      "an i",
      "di m",
      "as ining",
      "Ġy irik",
      "k or",
      "l at",
      "Ġh ar",
      "ek tor",
      "Ġd un",
      "Ġx iz",
      "Ġet di",
      "Ġ ik",
      "Ġ dir",
      "lan di",
      "ĠJ P",
      "a li",
      "Ġhis ob",
      "Ġ 4",
      "Ġ l",
      "' m",
      "Ġm ar",
      "Ġm ah",
      "s ul",
      "Ġd eb",
      "Ġda st",
      "uning dek",
      "u p",
      "Ġ ga",
      "ĠC o",
      "Ġdir ektor",
      "ĠS t",
      "a c",
      "a x",
      "Ġd o",
      "ay t",
      "i j",
      "li g",
      "ĠB u",
      "ik a",
      "av iy",
      "m oq",
      "v ar",
      "Ġa m",
      "Ġd ar",
      "ĠS p",
      "if f",
      "Ġjoy lashgan",
      "m o",
      "r in",
      "Ġ uning",
      "ish ni",
      "er s",
      "Ġy ar",
      "l ov",
      "r e",
      "Ġdun yo",
      "sul ot",
      "i or",
      "Ġk eyin",
      "Ġbosh qar",
      "x on",
      "Ġb iz",
      "Ġt ur",
      "Ġj am",
      "Ġshah r",
      "at or",
      "Ġt an",
      "20 0",
      "Ġ -",
      "sh i",
      "âĢ Ļ",
      "t s",
      "lar dan",
      "Ġr e",
      "Ġz av",
      "Ġxiz mat",
      "iff an",
      "s at",
      "iy at",
      "Ġta q",
      "oh n",
      "Ġmah sulot",
      "n es",
      "Ġ im",
      "Ġt el",
      "as e",
      "Ġe sa",
      "iffan y",
      "d or",
      "il ar",
      "li q",
      "Ġq is",
      "tab r",
      "a f",
      "r i",
      "Ġk am",
      "er g",
      "Ġa l",
      "h a",
      "Ġbo zor",
      "ti q",
      "r en",
      "on i",
      "Ġm av",
      "ĠCh ase",
      "ran s",
      "e p",
      "m i",
      "ga cha",
      "Ġs av",
      "Ġdav om",
      "l ek",
      "t siya",
      "lar ining",
      "un da",
      "lari dan",
      "ĠJ ohn",
      "Ġkor por",
      "S A",
      "y in",
      "in di",
      "Ġh aq",
      "ĠJ on",
      "k in",
      "Ġk en",
      "ish ga",
      "ĠA mer",
      "ma gan",
      "Ġ19 9",
      "Ġet ilgan",
      "Ġbiz nes",
      "p r",
      "siy asi",
      "Ġyar at",
      "l l",
      "an al",
      "as m",
      "yil dan",
      "Ġta k",
      "lan adi",
      "o iz",
      "Ġf oiz",
      "ĠT iffany",
      "Ġbosh qa",
      "Ġma sh",
      "Ġor qa",
      "M organ",
      "Ġk on",
      "a z",
      "li f",
      "Ġk ab",
      "is t",
      "ĠD ior",
      "p p",
      "v ig",
      "in a",
      "sh bu",
      "Ġt ush",
      "Ġbir i",
      "Ġor tiq",
      "ag en",
      "M W",
      "Ġb ank",
      "Ġq ur",
      "Ġq ay",
      "Ġte x",
      "Ġdast ur",
      "r sat",
      "w agen",
      "ish ini",
      "Ġu l",
      "ol ks",
      "Ġsh uningdek",
      "Ġorqa li",
      "olks wagen",
      "h ma",
      "Ġ Ġ",
      "ot if",
      "Ġkompaniy aning",
      "ĠJohn son",
      "vig at",
      "otif y",
      "n ol",
      "p er",
      "Ġ di",
      "Ġm oliy",
      "yil ning",
      "m as",
      "Ġr aq",
      "Ġdol larga",
      "Ġi chi",
      "l um",
      "p i",
      "Ġ 6",
      "Ġ 7",
      "Ġk el",
      "iy asi",
      "Ġm od",
      "ot i",
      "ompan iya",
      "Ġik ki",
      "a da",
      "d ing",
      "Ġ il",
      "en c",
      "Ġd vigat",
      "Ġr o",
      "os i",
      "Ġol gan",
      "Ġosh ir",
      "2 1",
      "e ug",
      "l er",
      "o da",
      "Ġb ar",
      "la gan",
      "Ġkompaniy asining",
      "f f",
      "v o",
      "Ġh ol",
      "ĠSp otify",
      "ĠJon son",
      "Ġkab i",
      "Ġqil gan",
      "ah on",
      "Ġham kor",
      "Ġyo ki",
      "ĠAmer ika",
      "Ġtak lif",
      "enc ent",
      "eug e",
      "a lar",
      "Ġo k",
      "Ġq ol",
      "ĠB MW",
      "it oy",
      "tir ish",
      "ĠP SA",
      "Ġ19 8",
      "Ġkor xon",
      "ĠJP Morgan",
      "Ġul ush",
      "euge ot",
      "5 0",
      "y u",
      "z gar",
      "Ġb ren",
      "Ġm um",
      "en z",
      "Ġj ar",
      "Ġnom i",
      "Ġsav do",
      "r is",
      "Ġ 8",
      "an g",
      "er al",
      "ot gan",
      "us t",
      "Ġchiqar uvchi",
      "00 0",
      "Ġmum kin",
      "e ch",
      "j ud",
      "r t",
      "Ġ ,",
      "ĠA l",
      "ĠT encent",
      "ro up",
      "ĠR os",
      "Ġbu y",
      "ĠIn c",
      "Ġken ga",
      "Ġqay ta",
      "Ġdvigat el",
      "m an",
      "or at",
      "la k",
      "as t",
      "tir di",
      "Ġi j",
      "ev ro",
      "Ġmav jud",
      "Ġs port",
      "ĠB ir",
      "Ġf a",
      "Ġqil adi",
      "ro q",
      "Ġasos iy",
      "lig ini",
      "o p",
      "Ġ iy",
      "Ġb or",
      "Ġk uni",
      "iy aning",
      "er i",
      "Ġy et",
      "cha lik",
      "uv chilar",
      "m ay",
      "m asi",
      "Ġ dan",
      "ar bu",
      "Ġo lib",
      "Ġy or",
      "ĠP eugeot",
      "Ġ201 8",
      "ĠV olkswagen",
      "art n",
      "ĠQ o",
      "Ġak siya",
      "Ġdar om",
      "Ġjam o",
      "Ġzav od",
      "Ġtaq dim",
      "arbu c",
      "r os",
      "v oz",
      "y ut",
      "Ġ1 8",
      "ĠA d",
      "ĠM organ",
      "Ġr ek",
      "ob e",
      "um la",
      "asm iy",
      "arbuc ks",
      "a lari",
      "e di",
      "f or",
      "n a",
      "o sh",
      "u h",
      "u di",
      "da m",
      "li m",
      "ish da",
      "Ġva q",
      "oz ir",
      "ĠSh tat",
      "Ġke lib",
      "b a",
      "g il",
      "h ur",
      "o di",
      "z i",
      "or k",
      "ĠG roup",
      "ĠF ed",
      "ĠE n",
      "Ġdunyo dagi",
      "k an",
      "ati on",
      "Ġkompaniy asini",
      "ĠSt arbucks",
      "umla dan",
      "' ll",
      "b iy",
      "q iq",
      "y x",
      "Ġk at",
      "Ġt rans",
      "Ġm us",
      "Ġ1 0",
      "Ġtar k",
      "lay di",
      "Ġmash hur",
      "o og",
      "v es",
      "Ġ %",
      "Ġt iz",
      "or t",
      "Ġm ay",
      "Ġp oy",
      "nol og",
      "Ġhamkor lik",
      "a p",
      "h e"
    ]
  }
}